In [1]:
# Exp 7

In [2]:
#Aim : Simple Linear Regression

In [3]:
#Name:Punam Khotele
#Year:3^rd
#Sec:C
#Roll No.:30
#sub:ET-I

In [4]:
import pandas as pd
import numpy as np

In [5]:
import os

In [6]:
os.getcwd()

'C:\\Users\\HP'

In [7]:
os.chdir('C:\\Users\\HP\\Desktop')

In [8]:
df=pd.read_csv("Salary_Data.csv")

In [9]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [10]:
df.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [11]:
df.shape

(30, 2)

In [12]:
df.size

60

In [13]:
df.ndim

2

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [15]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [16]:
df.isna()

    YearsExperience  Salary
0             False   False
1             False   False
2             False   False
3             False   False
4             False   False
5             False   False
6             False   False
7             False   False
8             False   False
9             False   False
10            False   False
11            False   False
12            False   False
13            False   False
14            False   False
15            False   False
16            False   False
17            False   False
18            False   False
19            False   False
20            False   False
21            False   False
22            False   False
23            False   False
24            False   False
25            False   False
26            False   False
27            False   False
28            False   False
29            False   False

In [17]:
df.isna().any()

YearsExperience    False
Salary             False
dtype: bool

# Independent and Dependent Variable

In [18]:
x = df.drop("Salary",axis=1) #working on column for row axis=0

In [19]:
x.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [20]:
y = df.Salary

In [21]:
y.head()

0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
Name: Salary, dtype: float64

In [27]:
from sklearn.model_selection import train_test_split

In [28]:
x_train, x_test, y_train, y_test =train_test_split(x,y, random_state=0)

In [29]:
print(x_train.shape)

(22, 1)

In [30]:
print(x_test.shape)

(8, 1)

# Model Fitting

In [32]:
from sklearn.linear_model import LinearRegression
LR=LinearRegression()
LR.fit(x_train,y_train)

LinearRegression()

In [33]:
#Assigning coeficient to m
m = LR.coef_

In [34]:
print("Coefiecient : ",m)

Coefiecient :  [9379.71049195]

In [35]:
#Assigning y_intercept to a
c = LR.intercept_

In [36]:
print("Intercept : ",c)

Intercept :  26986.691316737248

# Evaluation Matrix

In [37]:
from sklearn import metrics

In [38]:
Accuracy = LR.score(x_test,y_test)

In [39]:
Accuracy

0.9779208335417602